In [168]:
import pandas as pd

df=pd.read_csv("Titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [169]:
'''ðŸ”° PHASE 1: Data Loading & First Look (DO NOT SKIP)

Q1. Display the first 5 rows
Q2. Display the last 5 rows
Q3. Find number of rows and columns
Q4. Print all column names
Q5. Show data types and non-null counts

ðŸ‘‰ Goal: Understand what data you are dealing with
'''

'ðŸ”° PHASE 1: Data Loading & First Look (DO NOT SKIP)\n\nQ1. Display the first 5 rows\nQ2. Display the last 5 rows\nQ3. Find number of rows and columns\nQ4. Print all column names\nQ5. Show data types and non-null counts\n\nðŸ‘‰ Goal: Understand what data you are dealing with\n'

In [170]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [171]:
print("shape is ",df.shape)
df.info()

shape is  (891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [172]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [173]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [174]:
df.describe(include="all")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [175]:
#snake casing for easy access

df.columns=df.columns.str.strip().str.lower().str.replace(" ","_")
df.columns

Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [176]:
df.drop_duplicates()
df.shape

(891, 12)

In [177]:
'''
ðŸ” PHASE 2: Understanding Data Quality

Q6. Find number of missing values in each column
Q7. Which columns have more than 30% missing values?
Q8. Find total number of duplicate rows
Q9. Get statistical summary of numerical columns
Q10. Get summary including categorical columns

ðŸ‘‰ Goal: Decide what to clean, drop, or fix
'''

'\nðŸ” PHASE 2: Understanding Data Quality\n\nQ6. Find number of missing values in each column\nQ7. Which columns have more than 30% missing values?\nQ8. Find total number of duplicate rows\nQ9. Get statistical summary of numerical columns\nQ10. Get summary including categorical columns\n\nðŸ‘‰ Goal: Decide what to clean, drop, or fix\n'

In [178]:
df.isnull().sum()

passengerid      0
survived         0
pclass           0
name             0
sex              0
age            177
sibsp            0
parch            0
ticket           0
fare             0
cabin          687
embarked         2
dtype: int64

In [179]:
'''
ðŸ§¼ PHASE 3: Handling Missing Values (CORE SKILL)

Q11. Fill missing age values using mean
Q12. Fill missing embarked values using mode
Q13. Drop the cabin column
Q14. Verify there are no missing values left'''

'\nðŸ§¼ PHASE 3: Handling Missing Values (CORE SKILL)\n\nQ11. Fill missing age values using mean\nQ12. Fill missing embarked values using mode\nQ13. Drop the cabin column\nQ14. Verify there are no missing values left'

In [180]:
df["cabin"].head(20)
df=df.drop(columns=["cabin"])

In [181]:
df.fillna(df["age"].mean(),inplace=True)
import numpy as np

df["embarked"] = df["embarked"].apply(
    lambda x: np.nan if isinstance(x, (int, float)) else x
)


df["embarked"].fillna(df["embarked"].mode()[0], inplace=True)

C:\Users\shyam\AppData\Local\Temp\ipykernel_24500\1235807598.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["embarked"].fillna(df["embarked"].mode()[0], inplace=True)

In [182]:
df.isnull().sum()

passengerid    0
survived       0
pclass         0
name           0
sex            0
age            0
sibsp          0
parch          0
ticket         0
fare           0
embarked       0
dtype: int64

In [183]:
'''
ðŸŽ¯ PHASE 5: Data Type Fixing

Q15. Convert survived column to category
Q16. Convert sex column to category
Q17. Convert pclass column to category

ðŸ‘‰ Goal: Memory optimization + clarity
'''

'\nðŸŽ¯ PHASE 5: Data Type Fixing\n\nQ15. Convert survived column to category\nQ16. Convert sex column to category\nQ17. Convert pclass column to category\n\nðŸ‘‰ Goal: Memory optimization + clarity\n'

In [184]:
df["survived"]=df["survived"].apply(lambda x: "survived" if x==1 else "not survived")
df["survived"]=df["survived"].astype("category")
df["sex"]=df["sex"].astype("category")
df["pclass"]=df["pclass"].astype("category")

In [185]:
df["pclass"].head(5)

0    3
1    1
2    3
3    1
4    3
Name: pclass, dtype: category
Categories (3, int64): [1, 2, 3]

In [186]:
df["survived"].head()

0    not survived
1        survived
2        survived
3        survived
4    not survived
Name: survived, dtype: category
Categories (2, object): ['not survived', 'survived']

In [187]:
df["sex"].head()

0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: category
Categories (2, object): ['female', 'male']

In [188]:
'''
ðŸ”Ž PHASE 6: Feature Understanding (Selection & Filtering)

Q18. Select only age, sex, fare columns
Q19. Find passengers older than 60
Q20. Find female passengers in 1st class
Q21. Find passengers who paid fare > average fare
'''

'\nðŸ”Ž PHASE 6: Feature Understanding (Selection & Filtering)\n\nQ18. Select only age, sex, fare columns\nQ19. Find passengers older than 60\nQ20. Find female passengers in 1st class\nQ21. Find passengers who paid fare > average fare\n'

In [189]:
df[["age","sex"]].head()

    age     sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [190]:
df[df["age"]>60].head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked
33,34,not survived,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,S
54,55,not survived,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,C
96,97,not survived,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,C
116,117,not survived,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,Q
170,171,not survived,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,S

In [191]:
df[(df["sex"]=="female" ) &(df["pclass"]==1)].head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked
1,2,survived,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C
3,4,survived,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,S
11,12,survived,1,"Bonnell, Miss. Elizabeth",female,58.000000,0,0,113783,26.5500,S
31,32,survived,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,29.699118,1,0,PC 17569,146.5208,C
52,53,survived,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.000000,1,0,PC 17572,76.7292,C

In [192]:
average_fare=df["fare"].mean()
print("average fare",average_fare)
df[df["fare"]>average_fare].head()

average fare 32.204207968574636

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked
1,2,survived,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
3,4,survived,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
6,7,not survived,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,S
23,24,survived,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,S
27,28,not survived,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,S

In [193]:
'''
âž• PHASE 7: Feature Engineering (VERY IMPORTANT)

Q22. Create a column family_size = sibsp + parch + 1
Q23. Create a column is_alone

1 if family_size == 1

0 otherwise

Q24. Create a column fare_per_person
'''

'\nâž• PHASE 7: Feature Engineering (VERY IMPORTANT)\n\nQ22. Create a column family_size = sibsp + parch + 1\nQ23. Create a column is_alone\n\n1 if family_size == 1\n\n0 otherwise\n\nQ24. Create a column fare_per_person\n'

In [194]:
df["family_size"]=df["sibsp"]+df["parch"]+1
df["family_size"].head(10)

0    2
1    2
2    1
3    2
4    1
5    1
6    1
7    5
8    3
9    2
Name: family_size, dtype: int64

In [195]:
df["is_alone"]=df["family_size"].apply(lambda x: 1 if x==1 else 0)
df["is_alone"].head()
df["is_alone"].astype("category")

0      0
1      0
2      1
3      0
4      1
      ..
886    1
887    1
888    0
889    1
890    1
Name: is_alone, Length: 891, dtype: category
Categories (2, int64): [0, 1]

In [196]:
df["fare_average"]=df["fare"]/df["family_size"]
df["fare_average"].head().round(2)

0     3.62
1    35.64
2     7.92
3    26.55
4     8.05
Name: fare_average, dtype: float64

In [197]:
'''
ðŸ“Š PHASE 8: GroupBy Analysis (REAL ANALYSIS)

Q25. Find survival rate by gender
Q26. Find survival rate by passenger class
Q27. Find average age of survivors vs non-survivors
Q28. Find average fare by embarkation port
'''

'\nðŸ“Š PHASE 8: GroupBy Analysis (REAL ANALYSIS)\n\nQ25. Find survival rate by gender\nQ26. Find survival rate by passenger class\nQ27. Find average age of survivors vs non-survivors\nQ28. Find average fare by embarkation port\n'

In [198]:
df["survived"].nunique()

2

In [199]:
df["survived"] = df["survived"].replace({
    "not survived": 0,
    "survived": 1
})

df["survived"] = df["survived"].astype(int)
df.groupby("sex")["survived"].mean()

C:\Users\shyam\AppData\Local\Temp\ipykernel_24500\1316643387.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["survived"] = df["survived"].replace({
C:\Users\shyam\AppData\Local\Temp\ipykernel_24500\1316643387.py:1: FutureWarning: The behavior of Series.replace (and DataFrame.replace) with CategoricalDtype is deprecated. In a future version, replace will only be used for cases that preserve the categories. To change the categories, use ser.cat.rename_categories instead.
  df["survived"] = df["survived"].replace({
C:\Users\shyam\AppData\Local\Temp\ipykernel_24500\1316643387.py:7: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [200]:
df.groupby("pclass")["survived"].mean().round(2)

C:\Users\shyam\AppData\Local\Temp\ipykernel_24500\4118110616.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("pclass")["survived"].mean().round(2)

pclass
1    0.63
2    0.47
3    0.24
Name: survived, dtype: float64

In [201]:
df.groupby("survived")["age"].mean().round(2)

survived
0    30.42
1    28.55
Name: age, dtype: float64

In [202]:
df.groupby("embarked")["fare"].mean().round()

embarked
C    60.0
Q    13.0
S    27.0
Name: fare, dtype: float64

In [204]:
clean_df=df[["survived","pclass","age","fare","family_size","is_alone"]]
clean_df.to_csv("cleaned_data.csv",index=False)